app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def authorize_request
    header = request.headers['authorization']
    header = header.split(' ').last if header
    @decoded = decode(header)
    @current_user = User.find(@decoded[:user_id])