app/controllers/authentication_controller.rb

  def login
    p params[:username]
    @user = User.find_by_username(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", ""], ["LIMIT", 1]]