app/controllers/reviews_controller.rb

  def index
    @stay = Stay.find(params[:stay_id])
    @reviews = Review.where(stay_id: @stay.id)
---
SELECT  "stays".* FROM "stays" WHERE "stays"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."stay_id" = $1  [["stay_id", 1]]

  def create
    @stay = Stay.find(params[:stay_id])
    @review = Review.new(review_params)
    @review.user = @current_user
    @review.stay = @stay
    if @review.save
---
SELECT  "stays".* FROM "stays" WHERE "stays"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "created_at", "updated_at", "user_id", "stay_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "great"], ["created_at", "2019-08-14 20:56:02.518648"], ["updated_at", "2019-08-14 20:56:02.518648"], ["user_id", 2], ["stay_id", 1]]

  def update
    @review = Review.find(params[:id])
    if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "ugh"], ["updated_at", "2019-08-14 21:09:06.811301"], ["id", 5]]

  def destroy
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 6]]