app/controllers/stays_controller.rb

SELECT "stays".* FROM "stays"
---
  def index
    @stays = Stay.all

SELECT  "stays".* FROM "stays" WHERE "stays"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @stay = Stay.find(params[:id])